#pragma once
#include <string>

namespace task
{
	///////////////////////////////////////////////////////////////////////////
	//
	//	Парсит командную строку, возвращает извлечённые параметры.
	//	Также проверяет реальное существование директории.
	//
	///////////////////////////////////////////////////////////////////////////
	class CmdLineParser
	{
	public:
		CmdLineParser(int argc, char** argv);

		// --------------------------------------------------------------------
		// Возвращает адрес страницы, которую требуется загрузить.
		// --------------------------------------------------------------------
		inline std::string GetUrl() const;

		// --------------------------------------------------------------------
		// Возвращает директорию, в которую требуется сохранить страницу.
		// --------------------------------------------------------------------
		inline std::string GetDirectory() const;

	private:
		std::string m_url;
		std::string m_directory;

	private:
		void CheckDirectoryExistance();
	};

	///////////////////////////////////////////////////////////////////////////
}

// ----------------------------------------------------------------------------
inline std::string task::CmdLineParser::GetUrl() const
{
	return m_url;
}

// ----------------------------------------------------------------------------
inline std::string task::CmdLineParser::GetDirectory() const
{
	return m_directory;
}

// ----------------------------------------------------------------------------
