#pragma once
#include <string_view>
#include <list>
#include "TagRecognizer.h"

namespace task
{
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//
	//	Отвечает за скачивание страницы вместе с зависимостями.
	//	В случае ошибок генерируют исключения, производные от WinsockException.
	//	Во всех функциях url должен быть указан полностью, включая протокол, например:
	//		http://123.45.67.8/some/page.html
	//		http://qwerty.com/another/page/
	//		http://qwerty.com/logo.jpg
	//		http://qwerty.com/
	//
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	class HttpDownloader
	{
	public:
		// ------------------------------------------------------------------------------------------------------------
		// Добавляет распознаватель тега.
		// ------------------------------------------------------------------------------------------------------------
		void AddDependencyRecognizer(const TagRecognizer& tagRecognizer);

		// ------------------------------------------------------------------------------------------------------------
		// Скачивает файл по указанному URL по протоколу HTTP и возвращает его
		// содержимое в виде строки.
		// ------------------------------------------------------------------------------------------------------------
		std::string DownloadFile(std::string_view pageUrl);

		// ------------------------------------------------------------------------------------------------------------
		// Скачивает по указанному URL HTML-страницу по протоколу HTTP и сохраняет
		// её как difectory/fileName.html
		// Также в папку difectory/fileName будут скачаны зависимые объекты.
		// ------------------------------------------------------------------------------------------------------------
		void DownloadPageWithDependencies(
			std::string_view difectory,
			std::string_view fileName,
			std::string_view pageUrl);

	private:

		// ------------------------------------------------------------------------------------------------------------
		// Отвечает за инициализацию и очистку библиотеки Winsock.
		// ------------------------------------------------------------------------------------------------------------
		class WinsockInitializerAndCleaner
		{
		public:
			WinsockInitializerAndCleaner();
			~WinsockInitializerAndCleaner();
		private:
			bool IsWinsockInitialized();
			void InitializeWinsock();
			void CleanupWinsock();
		};

		static WinsockInitializerAndCleaner m_winsockInitializerAndCleaner;
		// ------------------------------------------------------------------------------------------------------------

	private:
		std::list<TagRecognizer> m_recognizers;
	};

	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
}