#pragma once
#include <string_view>
#include <list>
#include "TagRecognizer.h"

namespace task
{
	// ----------------------------------------------------------------------------------------------------------------
	// Преобразует англоязычный текст в нижний регистр.
	// ----------------------------------------------------------------------------------------------------------------
	std::string ToLower(std::string_view str);

	// ----------------------------------------------------------------------------------------------------------------
	// Извлекает имя хоста из адреса страницы.
	// ----------------------------------------------------------------------------------------------------------------
	// Правильный формат:
	//		http://<имя_хоста>/.../.../
	//		http://<имя_хоста>/.../...
	//		http://<имя_хоста>
	// Функция требует указания в адресе протокола HTTP (и только его),
	// иначе генерирует исключение.
	// Корректно раотает с IP-адресами, указанными в формате выше.
	// Регистр адреса неважен.
	// ----------------------------------------------------------------------------------------------------------------
	std::string_view GetHttpHostNameByUrl(std::string_view pageUrl);

	// ----------------------------------------------------------------------------------------------------------------
	// Находит все подстроки в соответствии с заданными паттернами.
	// ----------------------------------------------------------------------------------------------------------------
	std::list<std::string> ExtractPatternsFromSource(
		const std::string& source,
		const std::list<TagRecognizer>& recognizers);

	// ----------------------------------------------------------------------------------------------------------------
	// Пытается построить абсолютный путь к указанному файлу.
	// Если не удалось, возвращат пустую строку.
	// ----------------------------------------------------------------------------------------------------------------
	std::string GetAbsoluteHttpPath(const std::string& path, const std::string& hostName);

	// ----------------------------------------------------------------------------------------------------------------
	// Извлекает имя файла из пути к нему.
	// ----------------------------------------------------------------------------------------------------------------
	std::string GetFileName(const std::string& path);
}