#pragma once
#include <string_view>

namespace task
{
	// ----------------------------------------------------------------------------------------------------------------
	// Преобразует IP-адрес заданный в строковой форме или имя хоста в IP-адрес,
	// заданны в формате UL, которым можно инициализировать все поля sockaddr_in за раз.
	// Примеры корректных аргументов: "123.45.67.8" или "qwe.rty.com".
	// ----------------------------------------------------------------------------------------------------------------
	unsigned long GetServerAddress(std::string_view hostName);

	// ----------------------------------------------------------------------------------------------------------------
}